import React, { useEffect, useState } from 'react';
import '../../src/App.css';
import AddNewTravel from './AddNewTravel';

//עמוד ניהול -  רק מנהל המערכת מורשה לבצע את הפעולות הבאות
function Management() {



    return(
        <div>
       

            <h1>ברוך הבא מנהל</h1>
            {/* למנהל יש אופציות של:
             הוספת נסיעה חדשה
              עידכון נסיעה לשעה אחרת או תאריך אחר אם אין נרשמים
              מחיקת נסיעה אם אין נרשמים 
                הוספת אתר חדש
                הוספת כרטיסים לאתר
                עידכון כרטיס לאתר אם אין נסיעה עתידית עם נרשמים...
                הוספת נהג חדש
                הוספת אוטובוס חדש
                שיבוץ אוטובוס לנסיעה
                שיבוץ נרשמים לאוטובוס
                קביעת מסלול לאוטובוס
                סגירת ההרשמה לנסיעה מסוימת?
                ביטול נסיעה באין מספיק נרשמים?

                עידכון פרטי נהג קיים או מחיקתו באין שיבוץ מסוים בו מופיע
                עידכון אתר או מחיקתו באין נסיעות אליו
            */}

<AddNewTravel/>
        </div>    
    )
}

export default Management;


